In [10]:
import numpy as np
import pandas as pd

data = {
    "Employee": 
        ["Klaus Poppe", "Franz Bonaparta", np.nan, "Jakub Farobek", "Emil Šébe", "Helmuth Voss", "Josef Bäumler", "Klaus Poppe", "Franz Bonaparta", "Jakub Farobek", "Emil Šébe", "Helmuth Voss", "Josef Bäumler"],
    "Salary": 
        [1000, None, 320, 450, 420, np.nan, np.nan, 1000, None, 450, 420, np.nan, np.nan],
    "Performance%": 
        [98, None, 50, 10, 43, 2, 67, 98, None, 10, np.nan, np.nan, 13],
    "Year": 
        [2023, 2023, 2023, 2023, 2023, 2023, 2023, 2024, 2024, 2024, 2024, 2024, 2024]
}

df = pd.DataFrame(data=data)
# df["Employee"] = df["Employee"].dropna(axis=0, inplace=False) # Doesn't work 
df.dropna(subset=["Employee"], axis=0, inplace=True) # But this does

df.fillna({'Salary': 0.0, 'Performance%': 0.0}, inplace=True)
df = df.astype({'Salary': 'float32', 'Performance%': 'int32'})

df.head()

          Employee  Salary  Performance%  Year
0      Klaus Poppe  1000.0            98  2023
1  Franz Bonaparta     0.0             0  2023
3    Jakub Farobek   450.0            10  2023
4        Emil Šébe   420.0            43  2023
5     Helmuth Voss     0.0             2  2023

In [8]:
copy = df.rename(columns={"Employee":"Employee Name"}, inplace=False)
copy.head()

     Employee Name  Salary  Performance%  Year
0      Klaus Poppe  1000.0            98  2023
1  Franz Bonaparta     0.0             0  2023
3    Jakub Farobek   450.0            10  2023
4        Emil Šébe   420.0            43  2023
5     Helmuth Voss     0.0             2  2023

In [9]:
df_copy = df.copy()
df_copy.columns = ["Employee Name", "Salary", "Performance%", "Year"]
df_copy.head()

     Employee Name  Salary  Performance%  Year
0      Klaus Poppe  1000.0            98  2023
1  Franz Bonaparta     0.0             0  2023
3    Jakub Farobek   450.0            10  2023
4        Emil Šébe   420.0            43  2023
5     Helmuth Voss     0.0             2  2023